<?xml version="1.0" ?>
<net name="nanodet" version="10">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data shape="1, 3, 512, 288" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="data">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>288</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_1198928530" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="0" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="data/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>288</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>288</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_1199129310" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="12" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>288</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>288</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="1532" type="Const" version="opset1">
			<data element_type="f32" shape="24, 3, 3, 3" offset="24" size="2592"/>
			<output>
				<port id="0" precision="FP32" names="1532">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>288</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv_0/Dims6372" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="2616" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1531">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="LeakyRelu_1/weights1825729661" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="2712" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="LeakyRelu_1" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="890">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="MaxPool_2" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" kernel="3, 3" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="891">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="1535" type="Const" version="opset1">
			<data element_type="f32" shape="24, 1, 1, 3, 3" offset="2716" size="864"/>
			<output>
				<port id="0" precision="FP32" names="1535">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_3/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_3/Dims6552" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="3580" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1534">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="1538" type="Const" version="opset1">
			<data element_type="f32" shape="88, 24, 1, 1" offset="3676" size="8448"/>
			<output>
				<port id="0" precision="FP32" names="1538">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_4/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_4/Dims6516" type="Const" version="opset1">
			<data element_type="f32" shape="1, 88, 1, 1" offset="12124" size="352"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1537">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="LeakyRelu_5/weights1830128659" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="2712" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="LeakyRelu_5" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="896">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="1541" type="Const" version="opset1">
			<data element_type="f32" shape="88, 24, 1, 1" offset="12476" size="8448"/>
			<output>
				<port id="0" precision="FP32" names="1541">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>128</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_6/Dims6852" type="Const" version="opset1">
			<data element_type="f32" shape="1, 88, 1, 1" offset="20924" size="352"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>128</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1540">
					<dim>1</dim>
					<dim>88</dim>
					<dim>128</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="LeakyRelu_7/weights1831728596" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="2712" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="LeakyRelu_7" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>128</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="899">
					<dim>1</dim>
					<dim>88</dim>
					<dim>128</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="1544" type="Const" version="opset1">
			<data element_type="f32" shape="88, 1, 1, 3, 3" offset="21276" size="3168"/>
			<output>
				<port id="0" precision="FP32" names="1544">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_8/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>128</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_8/Dims6450" type="Const" version="opset1">
			<data element_type="f32" shape="1, 88, 1, 1" offset="24444" size="352"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1543">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="1547" type="Const" version="opset1">
			<data element_type="f32" shape="88, 88, 1, 1" offset="24796" size="30976"/>
			<output>
				<port id="0" precision="FP32" names="1547">
					<dim>88</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_9/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_9/Dims6390" type="Const" version="opset1">
			<data element_type="f32" shape="1, 88, 1, 1" offset="55772" size="352"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1546">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="LeakyRelu_10/weights1834529586" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="2712" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="LeakyRelu_10" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="904">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Concat_11" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="905">
					<dim>1</dim>
					<dim>176</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="90629226" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="56124" size="40"/>
			<output>
				<port id="0" precision="I64" names="906">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_13" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>176</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="907">
					<dim>1</dim>
					<dim>2</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="587" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="56164" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Transpose_14" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="908">
					<dim>1</dim>
					<dim>88</dim>
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="90929379" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="56204" size="32"/>
			<output>
				<port id="0" precision="I64" names="909">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Reshape_16" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="910">
					<dim>1</dim>
					<dim>176</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="901429646" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="56236" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="46" name="901629265" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="56244" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Slice_27/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>176</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="921">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="4" precision="FP32" names="924">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="1550" type="Const" version="opset1">
			<data element_type="f32" shape="88, 88, 1, 1" offset="56260" size="30976"/>
			<output>
				<port id="0" precision="FP32" names="1550">
					<dim>88</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_31/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_31/Dims6384" type="Const" version="opset1">
			<data element_type="f32" shape="1, 88, 1, 1" offset="87236" size="352"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_31" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1549">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="LeakyRelu_32/weights1832128911" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="2712" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="LeakyRelu_32" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="927">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="1553" type="Const" version="opset1">
			<data element_type="f32" shape="88, 1, 1, 3, 3" offset="87588" size="3168"/>
			<output>
				<port id="0" precision="FP32" names="1553">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_33/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_33/Dims6462" type="Const" version="opset1">
			<data element_type="f32" shape="1, 88, 1, 1" offset="90756" size="352"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_33" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1552">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="1556" type="Const" version="opset1">
			<data element_type="f32" shape="88, 88, 1, 1" offset="91108" size="30976"/>
			<output>
				<port id="0" precision="FP32" names="1556">
					<dim>88</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_34/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_34/Dims6930" type="Const" version="opset1">
			<data element_type="f32" shape="1, 88, 1, 1" offset="122084" size="352"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_34" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1555">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="LeakyRelu_35/weights1839728701" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="2712" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="LeakyRelu_35" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="932">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Concat_36" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="933">
					<dim>1</dim>
					<dim>176</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="90629352" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="56124" size="40"/>
			<output>
				<port id="0" precision="I64" names="906">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Reshape_38" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>176</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="935">
					<dim>1</dim>
					<dim>2</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="589" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="56164" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Transpose_39" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="936">
					<dim>1</dim>
					<dim>88</dim>
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="909" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="56204" size="32"/>
			<output>
				<port id="0" precision="I64" names="909">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Reshape_41" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="938">
					<dim>1</dim>
					<dim>176</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="901928905" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="56236" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="72" name="902129355" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="56244" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Slice_52/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>176</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="949">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="4" precision="FP32" names="952">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="1559" type="Const" version="opset1">
			<data element_type="f32" shape="88, 88, 1, 1" offset="122436" size="30976"/>
			<output>
				<port id="0" precision="FP32" names="1559">
					<dim>88</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_56/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_56/Dims6990" type="Const" version="opset1">
			<data element_type="f32" shape="1, 88, 1, 1" offset="153412" size="352"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_56" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1558">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="LeakyRelu_57/weights1841329370" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="2712" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="LeakyRelu_57" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="955">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="1562" type="Const" version="opset1">
			<data element_type="f32" shape="88, 1, 1, 3, 3" offset="153764" size="3168"/>
			<output>
				<port id="0" precision="FP32" names="1562">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_58/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv_58/Dims6888" type="Const" version="opset1">
			<data element_type="f32" shape="1, 88, 1, 1" offset="156932" size="352"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv_58" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1561">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="1565" type="Const" version="opset1">
			<data element_type="f32" shape="88, 88, 1, 1" offset="157284" size="30976"/>
			<output>
				<port id="0" precision="FP32" names="1565">
					<dim>88</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_59/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_59/Dims6894" type="Const" version="opset1">
			<data element_type="f32" shape="1, 88, 1, 1" offset="188260" size="352"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_59" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1564">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="LeakyRelu_60/weights1838529583" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="2712" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="LeakyRelu_60" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="960">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Concat_61" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="961">
					<dim>1</dim>
					<dim>176</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="906" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="56124" size="40"/>
			<output>
				<port id="0" precision="I64" names="906">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Reshape_63" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>176</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="963">
					<dim>1</dim>
					<dim>2</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="584" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="56164" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Transpose_64" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="964">
					<dim>1</dim>
					<dim>88</dim>
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="90929406" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="56204" size="32"/>
			<output>
				<port id="0" precision="I64" names="909">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_66" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="966">
					<dim>1</dim>
					<dim>176</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="902429433" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="56236" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="98" name="902629367" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="56244" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Slice_77/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>176</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="977">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="4" precision="FP32" names="980">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="1568" type="Const" version="opset1">
			<data element_type="f32" shape="88, 88, 1, 1" offset="188612" size="30976"/>
			<output>
				<port id="0" precision="FP32" names="1568">
					<dim>88</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_81/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_81/Dims6828" type="Const" version="opset1">
			<data element_type="f32" shape="1, 88, 1, 1" offset="219588" size="352"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_81" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1567">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="LeakyRelu_82/weights1835328554" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="2712" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="LeakyRelu_82" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="983">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="1571" type="Const" version="opset1">
			<data element_type="f32" shape="88, 1, 1, 3, 3" offset="219940" size="3168"/>
			<output>
				<port id="0" precision="FP32" names="1571">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_83/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_83/Dims6546" type="Const" version="opset1">
			<data element_type="f32" shape="1, 88, 1, 1" offset="223108" size="352"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_83" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1570">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="1574" type="Const" version="opset1">
			<data element_type="f32" shape="88, 88, 1, 1" offset="223460" size="30976"/>
			<output>
				<port id="0" precision="FP32" names="1574">
					<dim>88</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_84/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_84/Dims6468" type="Const" version="opset1">
			<data element_type="f32" shape="1, 88, 1, 1" offset="254436" size="352"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_84" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1573">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="LeakyRelu_85/weights1826528890" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="2712" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="LeakyRelu_85" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="988">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Concat_86" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="989">
					<dim>1</dim>
					<dim>176</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="90629451" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="56124" size="40"/>
			<output>
				<port id="0" precision="I64" names="906">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Reshape_88" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>176</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="991">
					<dim>1</dim>
					<dim>2</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="583" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="56164" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Transpose_89" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>88</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="992">
					<dim>1</dim>
					<dim>88</dim>
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="90928983" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="56204" size="32"/>
			<output>
				<port id="0" precision="I64" names="909">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Reshape_91" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>2</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="994">
					<dim>1</dim>
					<dim>176</dim>
					<dim>64</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="1577" type="Const" version="opset1">
